app/Controllers/Classes.php

function index() {
    $model = new ClassModel();
    helper('text');
    $data['classes'] =$model->findAll();
---
SELECT *
FROM `classes`

public function edit($id){
        $model = new ClassModel();
        $data['classes'] =$model->find($id);
---
SELECT *
FROM `classes`
WHERE `classes`.`id` = '21'