app/Controllers/Faculties.php

SELECT *
FROM `faculties`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `faculties`
---
    public function facultyList(){

      $model = new FacultyModel();
      helper('text');




      $data = [
        'faculties' => $model->paginate(10),
        'pager' => $model->pager,
    ];