app/Controllers/Students.php

SELECT *
FROM `students`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `students`
---
    public function StudentList(){


        $model = new StudentModel();
        helper('text');

        $data = [
          'students' => $model->paginate(10),
          'pager' => $model->pager,
      ];