app/Controllers/Subjects.php

SELECT *
FROM `subjects`
---
function index() {
    $model = new SubjectModel();
    helper('text');
    $data['subjects'] =$model->findAll();